clear all;%%清除工作空间的所有变量，函数，和MEX文件
clc;%%清除命令窗口的内容
t= -4:0.01:4;%%以-10为起点,以10为终点,以0.1为步长的一维矩阵

ft1=func(t-2);%%生成函数实例
subplot(2,2,1);%%在平铺位置创建坐标区
plot(t,ft1,'b','Linewidth',2);%%绘制图形（自变量;函数;颜色;线宽;线宽参数）
xlabel('(a) f(t-2) ');%%为 x 轴添加标签
grid on;%%显示或隐藏坐标区网格线
axis([-4 4 -0.5 2]);%%设置坐标轴范围和纵横比

ft2=func(3*t);%%生成函数实例
subplot(2,2,2);%%在平铺位置创建坐标区
plot(t,ft2,'b','Linewidth',2);%%绘制图形（自变量;函数;颜色;线宽;线宽参数）
xlabel(' (b) f(3t) ');%%为 x 轴添加标签
grid on;%%显示或隐藏坐标区网格线
axis([-4 4 -0.5 2]);%%设置坐标轴范围和纵横比

ft3=func(-t);%%生成函数实例
subplot(2,2,3);%%在平铺位置创建坐标区
plot(t,ft3,'b','Linewidth',2);%%绘制图形（自变量;函数;颜色;线宽;线宽参数）
xlabel(' (c) f(-t) ');%%为 x 轴添加标签
grid on;%%显示或隐藏坐标区网格线
axis([-4 4 -0.5 2]);%%设置坐标轴范围和纵横比

ft4=func(-3*(t+2/3));%%生成函数实例
subplot(2,2,4);%%在平铺位置创建坐标区
plot(t,ft4,'b','Linewidth',2);%%绘制图形（自变量;函数;颜色;线宽;线宽参数）
xlabel(' (d) f(-3t-2) ');%%为 x 轴添加标签
grid on;%%显示或隐藏坐标区网格线
axis([-4 4 -0.5 2]);%%设置坐标轴范围和纵横比

function f1=func(t)%%定义函数表达式
f1 = 1.*(t>=-2 & t<0) + (1-t).*(t>=0 & t<=1) + 0.*(t-2 | t>1);
end